tap "adoptopenjdk/openjdk"
tap "cartr/qt4"
tap "cmacrae/formulae"
tap "felixkratz/formulae"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "hivemq/mqtt-cli"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jaybrown/cn"
tap "koekeishiya/formulae"
tap "louisbrunner/valgrind"
tap "nictap/tap"
tap "osx-cross/avr"
tap "rfidresearchgroup/proxmark3"
tap "riscv-software-src/riscv"
tap "supabase/tap"
tap "tomoyanonymous/flatcam"
tap "yandex/arc", "https://arc-vcs.yandex-team.ru/homebrew-tap"
brew "xz"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "arduino-cli"
brew "dbus", restart_service: :changed
brew "glib"
brew "at-spi2-core"
brew "atuin"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "boost"
brew "confuse"
brew "hidapi"
brew "libusb"
brew "libftdi"
brew "libusb-compat"
brew "avrdude"
brew "bash"
brew "libuv"
brew "node"
brew "bash-language-server"
brew "bat"
brew "protobuf"
brew "grpc"
brew "bear"
brew "binutils"
brew "bison"
brew "cairo"
brew "catdoc"
brew "ccache"
brew "python@3.13"
brew "llvm"
brew "ccls"
brew "gmp"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "dialog"
brew "certbot"
brew "pkgconf"
brew "hdf5"
brew "check"
brew "clang-format"
brew "clblas"
brew "clblast"
brew "clfft"
brew "cmake"
brew "coreutils"
brew "criterion"
brew "ctags"
brew "dfu-util"
brew "doxygen"
brew "dtc"
brew "faiss"
brew "fd"
brew "libevent"
brew "unbound"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "python@3.12"
brew "libmicrohttpd"
brew "librist"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@6"
brew "ffmpegthumbnailer"
brew "flex"
brew "fzf"
brew "gawk"
brew "geos"
brew "gtk+"
brew "gerbv"
brew "ghostscript"
brew "git"
brew "glibmm"
brew "glow"
brew "gnu-sed"
brew "go"
brew "gobject-introspection"
brew "gperf"
brew "openjdk"
brew "gradle"
brew "grep"
brew "helix"
brew "perl"
brew "help2man"
brew "highlight"
brew "howdoi"
brew "libheif"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libffi"
brew "libmagic"
brew "libzip"
brew "numpy"
brew "py3cairo"
brew "pygobject3"
brew "libsigrok"
brew "python@3.11"
brew "lnav"
brew "lsusb"
brew "lua-language-server"
brew "mas"
brew "mosquitto"
brew "ncdu"
brew "neovim"
brew "ninja"
brew "open-ocd"
brew "qt"
brew "pyqt"
brew "vtk"
brew "opencv"
brew "pam-reattach"
brew "patchutils"
brew "pcb2gcode"
brew "pcre"
brew "picocom"
brew "pipx"
brew "poetry"
brew "poppler"
brew "pyenv"
brew "pyqt@5"
brew "python-tk@3.12"
brew "python-tk@3.13"
brew "python@3.10"
brew "python@3.8"
brew "qemu"
brew "qrencode"
brew "redis"
brew "ripgrep"
brew "sdcc"
brew "shfmt"
brew "sigrok-cli"
brew "socat"
brew "spatialindex"
brew "sponge"
brew "swig"
brew "telnet"
brew "texinfo"
brew "the_silver_searcher"
brew "thefuck"
brew "tinc"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "translate-shell"
brew "tree"
brew "typescript"
brew "vcpkg"
brew "vifm"
brew "wget"
brew "xsv"
brew "youtube-dl"
brew "yq"
brew "yt-dlp"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "cartr/qt4/openssl@1.0"
brew "cmacrae/formulae/spacebar"
brew "felixkratz/formulae/sketchybar"
brew "gromgit/fuse/s3fs-mac"
brew "hivemq/mqtt-cli/mqtt-cli"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "nictap/tap/ooo"
brew "osx-cross/avr/avr-gcc@14", link: true
brew "osx-cross/avr/avr-gdb"
brew "rfidresearchgroup/proxmark3/proxmark3"
brew "riscv-software-src/riscv/riscv-tools"
brew "yandex/arc/arc-launcher"
cask "alacritty"
cask "alt-tab"
cask "docker"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-victor-mono-nerd-font"
cask "ghidra"
cask "macfuse"
cask "mongodb-compass"
cask "neovide"
cask "openscad"
cask "rar"
